; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-7)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	)
(:init
	(at plane1 city4)
	(= (capacity plane1) 9265)
	(= (fuel plane1) 3559)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 13)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 1)
	(at plane2 city0)
	(= (capacity plane2) 2845)
	(= (fuel plane2) 120)
	(= (slow-burn plane2) 1)
	(= (fast-burn plane2) 3)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 10)
	(at plane3 city9)
	(= (capacity plane3) 2385)
	(= (fuel plane3) 571)
	(= (slow-burn plane3) 1)
	(= (fast-burn plane3) 2)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 9)
	(at plane4 city3)
	(= (capacity plane4) 9689)
	(= (fuel plane4) 3820)
	(= (slow-burn plane4) 4)
	(= (fast-burn plane4) 8)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 7)
	(at plane5 city7)
	(= (capacity plane5) 9624)
	(= (fuel plane5) 247)
	(= (slow-burn plane5) 4)
	(= (fast-burn plane5) 8)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 6)
	(at person1 city9)
	(at person2 city2)
	(at person3 city8)
	(at person4 city2)
	(at person5 city8)
	(at person6 city4)
	(at person7 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 905)
	(= (distance city0 city2) 948)
	(= (distance city0 city3) 813)
	(= (distance city0 city4) 874)
	(= (distance city0 city5) 671)
	(= (distance city0 city6) 756)
	(= (distance city0 city7) 774)
	(= (distance city0 city8) 955)
	(= (distance city0 city9) 941)
	(= (distance city1 city0) 905)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 672)
	(= (distance city1 city3) 674)
	(= (distance city1 city4) 512)
	(= (distance city1 city5) 893)
	(= (distance city1 city6) 638)
	(= (distance city1 city7) 840)
	(= (distance city1 city8) 852)
	(= (distance city1 city9) 672)
	(= (distance city2 city0) 948)
	(= (distance city2 city1) 672)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 765)
	(= (distance city2 city4) 711)
	(= (distance city2 city5) 750)
	(= (distance city2 city6) 588)
	(= (distance city2 city7) 871)
	(= (distance city2 city8) 901)
	(= (distance city2 city9) 975)
	(= (distance city3 city0) 813)
	(= (distance city3 city1) 674)
	(= (distance city3 city2) 765)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 896)
	(= (distance city3 city5) 502)
	(= (distance city3 city6) 715)
	(= (distance city3 city7) 806)
	(= (distance city3 city8) 761)
	(= (distance city3 city9) 797)
	(= (distance city4 city0) 874)
	(= (distance city4 city1) 512)
	(= (distance city4 city2) 711)
	(= (distance city4 city3) 896)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 853)
	(= (distance city4 city6) 667)
	(= (distance city4 city7) 746)
	(= (distance city4 city8) 666)
	(= (distance city4 city9) 541)
	(= (distance city5 city0) 671)
	(= (distance city5 city1) 893)
	(= (distance city5 city2) 750)
	(= (distance city5 city3) 502)
	(= (distance city5 city4) 853)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 917)
	(= (distance city5 city7) 923)
	(= (distance city5 city8) 815)
	(= (distance city5 city9) 872)
	(= (distance city6 city0) 756)
	(= (distance city6 city1) 638)
	(= (distance city6 city2) 588)
	(= (distance city6 city3) 715)
	(= (distance city6 city4) 667)
	(= (distance city6 city5) 917)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 865)
	(= (distance city6 city8) 987)
	(= (distance city6 city9) 546)
	(= (distance city7 city0) 774)
	(= (distance city7 city1) 840)
	(= (distance city7 city2) 871)
	(= (distance city7 city3) 806)
	(= (distance city7 city4) 746)
	(= (distance city7 city5) 923)
	(= (distance city7 city6) 865)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 877)
	(= (distance city7 city9) 881)
	(= (distance city8 city0) 955)
	(= (distance city8 city1) 852)
	(= (distance city8 city2) 901)
	(= (distance city8 city3) 761)
	(= (distance city8 city4) 666)
	(= (distance city8 city5) 815)
	(= (distance city8 city6) 987)
	(= (distance city8 city7) 877)
	(= (distance city8 city8) 0)
	(= (distance city8 city9) 685)
	(= (distance city9 city0) 941)
	(= (distance city9 city1) 672)
	(= (distance city9 city2) 975)
	(= (distance city9 city3) 797)
	(= (distance city9 city4) 541)
	(= (distance city9 city5) 872)
	(= (distance city9 city6) 546)
	(= (distance city9 city7) 881)
	(= (distance city9 city8) 685)
	(= (distance city9 city9) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane3 city5)
	(at person1 city1)
	(at person2 city6)
	(at person3 city4)
	(at person5 city2)
	(at person6 city2)
	(at person7 city8)
	))

(:metric minimize (+ (* 3 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (fly plane4 city3 city4)
   deleted: (at plane4 city3)
   added: (at plane4 city4)
   changed: (total-fuel-used) from 0 to 3584, (fuel plane4) from 3820 to 236
   goals met: 0 of 7
2. (board person1 plane3 city9)
   deleted: (at person1 city9)
   added: (in person1 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 0 of 7
3. (refuel plane3 city9)
   changed: (fuel plane3) from 571 to 2385
   goals met: 0 of 7
4. (zoom plane3 city9 city1)
   deleted: (at plane3 city9)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 3584 to 4928, (fuel plane3) from 2385 to 1041
   goals met: 0 of 7
5. (board person6 plane1 city4)
   deleted: (at person6 city4)
   added: (in person6 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 0 of 7
6. (debark person1 plane3 city1)
   deleted: (in person1 plane3)
   added: (at person1 city1)
   changed: (onboard plane3) from 1 to 0
   goals met: 1 of 7
7. (fly plane3 city1 city5)
   deleted: (at plane3 city1)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 4928 to 5821, (fuel plane3) from 1041 to 148
   goals met: 2 of 7
8. (fly plane1 city4 city2)
   deleted: (at plane1 city4)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 5821 to 8665, (fuel plane1) from 3559 to 715
   goals met: 2 of 7
9. (refuel plane1 city2)
   changed: (fuel plane1) from 715 to 9265
   goals met: 2 of 7
10. (board person2 plane1 city2)
   deleted: (at person2 city2)
   added: (in person2 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 2 of 7
11. (debark person6 plane1 city2)
   deleted: (in person6 plane1)
   added: (at person6 city2)
   changed: (onboard plane1) from 2 to 1
   goals met: 3 of 7
12. (zoom plane1 city2 city6)
   deleted: (at plane1 city2)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 8665 to 16309, (fuel plane1) from 9265 to 1621
   goals met: 3 of 7
13. (debark person2 plane1 city6)
   deleted: (in person2 plane1)
   added: (at person2 city6)
   changed: (onboard plane1) from 1 to 0
   goals met: 4 of 7
14. (refuel plane2 city0)
   changed: (fuel plane2) from 120 to 2845
   goals met: 4 of 7
15. (board person7 plane2 city0)
   deleted: (at person7 city0)
   added: (in person7 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 4 of 7
16. (fly plane2 city0 city8)
   deleted: (at plane2 city0)
   added: (at plane2 city8)
   changed: (total-fuel-used) from 16309 to 17264, (fuel plane2) from 2845 to 1890
   goals met: 4 of 7
17. (debark person7 plane2 city8)
   deleted: (in person7 plane2)
   added: (at person7 city8)
   changed: (onboard plane2) from 1 to 0
   goals met: 5 of 7
18. (board person3 plane2 city8)
   deleted: (at person3 city8)
   added: (in person3 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 5 of 7
19. (board person5 plane2 city8)
   deleted: (at person5 city8)
   added: (in person5 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 5 of 7
20. (fly plane2 city8 city4)
   deleted: (at plane2 city8)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 17264 to 17930, (fuel plane2) from 1890 to 1224
   goals met: 5 of 7
21. (debark person3 plane2 city4)
   deleted: (in person3 plane2)
   added: (at person3 city4)
   changed: (onboard plane2) from 2 to 1
   goals met: 6 of 7
22. (fly plane2 city4 city2)
   deleted: (at plane2 city4)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 17930 to 18641, (fuel plane2) from 1224 to 513
   goals met: 6 of 7
23. (debark person5 plane2 city2)
   deleted: (in person5 plane2)
   added: (at person5 city2)
   changed: (onboard plane2) from 1 to 0
   goals met: 7 of 7
